     A          R MINMAXRC2
     A            DBCHAR     32766A         TEXT('Character')
     A                                      COLHDG('CHARACTER')
