     A          R MINMAXRC3
     A            DBHEXADEC  32766H         TEXT('Hexa Decimal')
     A                                      COLHDG('HEXA' 'DECIMAL')
