      *----------------------------------------------------------------
         dcl-s a varchar(100) inz('adsgdfgsgdf');
         dcl-s b varchar(100)  CCSID(*UTF8);
           b =a;
         *INLR = *ON;
