     FTESTPF    IT   F   15        DISK
     F*
     DPRE_ARR          S             15    DIM(2) FROMFILE(TESTPF) PERRCD(1)
     F*
     C     PRE_ARR(1)    DSPLY
     F*
     C     PRE_ARR(2)    DSPLY
     F*
     C*    PRE_ARR(3)    DSPLY
     F*
     C*    PRE_ARR(4)    DSPLY
     F*
     C*    PRE_ARR(5)    DSPLY
     C* Mainline
     C                   SETON                                        LR
