     FNAMEPF    IT   F   20        DISK                                              130201
     DNAME_ARR         S             20    DIM(5)                                    130201
     D                                     FROMFILE(NAMEPF) PERRCD(1)
     Didx              S              2  0
     C                   For       idx = 1 to 5 by 1                                   130201
     C*NAMEPF            eval      NAME_ARR(idx) = 'test'
     C     NAME_ARR(idx) DSPLY                                                       130201
     C                   endfor                                                      130201
     C                   SETON                                        LR             130201
