     H option(*nodebugio)
     FACCTDTA   IF   E           K DISK
      *
      *
     C                   read      ACCTDTA
     C                   dow       not %eof(ACCTDTA)
     C     FNAME         dsply
      *
      *
      *
     C                   read      ACCTDTA
     C                   enddo
     C                   eval      *inlr = *on
