     FACCTDTA   IF   E           K DISK
      *
      *
     C     *IN90         DOWLE     *on
     C                   read      ACCTDTA                                90
     C     FNAME         dsply
     C                   enddo
     C                   eval      *inlr = *on
