     D demo           UDS                  dtaara('DTAARA1')
     D fname                          5A
     D lname                          5A
      *
     C     fname         dsply
     C     lname         dsply
     C                   eval      *inlr = *on
