**FREE
ctl-opt option(*NOXREF:*NODEBUGIO:*SRCSTMT) dftactgrp(*NO) actgrp(*NEW)
        bnddir('CIBINDDIR':'QC2LE':'YAJL');

      dsply 'test';
      *inlr = *on;

